automationUpskill/code/TaoliQiao/apiTest/HttpClientDemo/src/main/resources/RequestTemplate/getWeather.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GetWeather>
            <!--Optional:-->
            <web:CityName>${CityName}</web:CityName>
            <!--Optional:-->
            <web:CountryName>${CountryName}</web:CountryName>
        </web:GetWeather>
    </soapenv:Body>
</soapenv:Envelope>