src/main/resources/requestXml/GetWeather.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://www.webserviceX.NET">
   <soap:Header/>
   <soap:Body>
      <web:GetWeather>
         <web:CityName>$CITY$</web:CityName>
         <web:CountryName>$COUNTRY$</web:CountryName>
      </web:GetWeather>
   </soap:Body>
</soap:Envelope>