src/main/resources/requestXml/GetCityByCountry.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://www.webserviceX.NET">
   <soap:Header/>
   <soap:Body>
      <web:GetCitiesByCountry>
         <web:CountryName>$COUNTRY$</web:CountryName>
      </web:GetCitiesByCountry>
   </soap:Body>
</soap:Envelope>